In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline 
import seaborn

In [2]:
alldata = pd.read_csv('/Users/claudia/Ironhack/Week3/goup_project/alldata.csv')

In [3]:
alldata.head()

,position,company,description,reviews,location
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,"Atlanta, GA"
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"

In [4]:
alldata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6964 entries, 0 to 6963
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   position     6953 non-null   object
 1   company      6953 non-null   object
 2   description  6953 non-null   object
 3   reviews      5326 non-null   float64
 4   location     6953 non-null   object
dtypes: float64(1), object(4)
memory usage: 272.2+ KB

In [5]:
alldata.dtypes #inspect the datatypes of each column

position        object
company         object
description     object
reviews        float64
location        object
dtype: object

In [6]:
alldata['position'].describe()  #describe for strings

count               6953
unique              5242
top       Data Scientist
freq                 351
Name: position, dtype: object

In [7]:
alldata.shape

(6964, 5)

In [8]:
#before splitting explore the fields
alldata['location'].value_counts()

Seattle, WA           563
New York, NY          508
Cambridge, MA         487
Boston, MA            454
San Francisco, CA     425
                     ...
Boston, MA 02134        1
Atlanta, GA 30350       1
Lynbrook, NY            1
New York, NY 10018      1
Whippany, NJ            1
Name: location, Length: 382, dtype: int64

In [9]:
#split one categorical column in two by saying to divide after the comma

alldata[['location', 'state']] = alldata['location'].str.split(',', 1, expand=True)

In [10]:
alldata['location'].value_counts()

New York         848
Seattle          777
Cambridge        694
Boston           629
San Francisco    564
                ...
East Hanover       1
Rutherford         1
Staten Island      1
Secaucus           1
Fremont            1
Name: location, Length: 91, dtype: int64

In [11]:
alldata['state'].value_counts()

 CA           1577
 MA            941
 WA            602
 NY            576
 IL            292
              ...
 CA 94941        1
 NJ 07310        1
 NY 10962        1
 DC 20229        1
 NY 10004        1
Name: state, Length: 318, dtype: int64

In [12]:
#here divide 
alldata[['state', 'zip_code']] = alldata['state'].str.split(expand=True)

In [13]:
alldata['zip_code'].value_counts()

98052    117
98109     95
02139     95
10016     88
92121     71
        ...
07030      1
98122      1
90015      1
30322      1
90046      1
Name: zip_code, Length: 288, dtype: int64

In [14]:
alldata

,position,company,description,reviews,location,state,zip_code
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,Atlanta,GA,30301
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,Atlanta,GA,None
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,Atlanta,GA,None
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,Atlanta,GA,30303
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,Atlanta,GA,None
...,...,...,...,...,...,...,...
6959,Data Developer / Machine Learning Analyst,NetApp,Are you data-driven? We at NetApp believe in t...,574.0,Sunnyvale,CA,None
6960,Scientist I,"Pharmacyclics, an Abbvie Company",Pharmacyclics is committed to the development ...,26.0,Sunnyvale,CA,None
6961,Intern Scientist,Oath Inc,"Oath, a subsidiary of Verizon, is a values-led...",5.0,Sunnyvale,CA,None
6962,Senior Data & Applied Scientist,Microsoft,We are the Bing Core Relevance team responsibl...,4618.0,Sunnyvale,CA,None
6963,"Principal Data Scientist, Deep Learning",Comcast,Comcast’s Technology &amp; Product organizatio...,11610.0,Sunnyvale,CA,94089

In [15]:
alldata.dtypes

position        object
company         object
description     object
reviews        float64
location        object
state           object
zip_code        object
dtype: object

In [16]:
alldata.isnull().sum()
#check for NaN values

position         11
company          11
description      11
reviews        1638
location         11
state            11
zip_code       4821
dtype: int64

In [18]:
#dropping the rows where there are NaNs
alldata.drop(index = alldata[alldata['position'].isnull()].index, inplace = True)

In [19]:
alldata.isnull().any()

position       False
company        False
description    False
reviews         True
location       False
state          False
zip_code        True
dtype: bool

In [20]:
alldata.isnull().sum()

position          0
company           0
description       0
reviews        1627
location          0
state             0
zip_code       4810
dtype: int64

In [23]:
alldata.shape

(6953, 7)

In [24]:
#make a copy of the dataframe
data = alldata.copy()

In [25]:
#let the index start from 1 insted of zero because you want to work in sql later
data.index = data.index + 1

In [31]:
data.to_csv('/Users/claudia/Ironhack/Week3/goup_project/data.csv')